views/create_job_request.xml.erb

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header />
    <SOAP-ENV:Body>
        <ns2:SendCreateJobRequestMessage xmlns:ns2="http://schemas.consiliumtechnologies.com/services/mobile/2009/03/messaging" xmlns="http://schemas.consiliumtechnologies.com/mobile/2009/03/CommonTypes.xsd" xmlns:ns10="http://schemas.consiliumtechnologies.com/mobile/2013/07/ReferralsTypes.xsd" xmlns:ns11="http://schemas.consiliumtechnologies.com/mobile/2013/07/ReferralsMessages.xsd" xmlns:ns12="http://schemas.consiliumtechnologies.com/mobile/2009/09/CompositeMessages.xsd" xmlns:ns13="http://schemas.consiliumtechnologies.com/mobile/2009/07/MaterialsMessages.xsd" xmlns:ns14="http://schemas.consiliumtechnologies.com/mobile/2009/07/MaterialsTypes.xsd" xmlns:ns15="http://schemas.consiliumtechnologies.com/mobile/2009/07/FormsMessages.xsd" xmlns:ns16="http://schemas.consiliumtechnologies.com/mobile/2008/05/TimesheetMessages.xsd" xmlns:ns17="http://schemas.consiliumtechnologies.com/mobile/2008/05/TimesheetTypes.xsd" xmlns:ns18="http://schemas.consiliumtechnologies.com/mobile/2008/10/LocationTypes.xsd" xmlns:ns19="http://schemas.consiliumtechnologies.com/mobile/2008/10/LocationMessages.xsd" xmlns:ns3="http://schemas.consiliumtechnologies.com/mobile/2015/05/OptimiseTypes.xsd" xmlns:ns4="http://schemas.consiliumtechnologies.com/mobile/2015/05/OptimiseMessages.xsd" xmlns:ns5="http://schemas.consiliumtechnologies.com/mobile/2009/03/VisitsTypes.xsd" xmlns:ns6="http://schemas.consiliumtechnologies.com/mobile/2009/07/FormsTypes.xsd" xmlns:ns7="http://schemas.consiliumtechnologies.com/mobile/2009/03/VisitsMessages.xsd" xmlns:ns8="http://schemas.consiliumtechnologies.com/mobile/2009/03/CommonMessages.xsd" xmlns:ns9="http://schemas.consiliumtechnologies.com/mobile/2009/04/FolioMessages.xsd">
            <ns2:SendMessageRequestInfo>
                <ns2:QueueName>\OPTIMISE\INPUT</ns2:QueueName>
                <ns2:Key>Debug</ns2:Key>
            </ns2:SendMessageRequestInfo>
            <ns2:CreateJobRequest>
                <ns4:Job>
                    <ns3:Identity>
                    	<ns3:Reference><%= job_id %></ns3:Reference>
                    </ns3:Identity>
                    <ns3:Location>
                        <ns3:AddressDetail>
                            <ns3:Lines>
                            <% if address.has_key?('line1') %>
                               <ns3:AddressLine>
                                 <%= address['line1'].strip %>
                               </ns3:AddressLine>
                            <% end %>
                            <% if address.has_key?('line2') %>
                               <ns3:AddressLine>
                                 <%= address['line2'].strip %>
                               </ns3:AddressLine>
                            <% end %>
                            <% if address.has_key?('line3') %>
                               <ns3:AddressLine>
                                 <%= address['line3'].strip %>
                               </ns3:AddressLine>
                            <% end %>
                            <% if address.has_key?('line4') %>
                               <ns3:AddressLine>
                                 <%= address['line4'].strip %>
                               </ns3:AddressLine>
                            <% end %>
                            </ns3:Lines>
                            <ns3:PostCode><%= address['postcode'].strip %></ns3:PostCode>
                        </ns3:AddressDetail>
                    </ns3:Location>
                    <ns3:Contact>
                        <ns3:Name><%= address['postcode'].strip %></ns3:Name>
                    </ns3:Contact>
                    <ns3:Description><%= tla %></ns3:Description>
                    <ns3:DueDate><%= due_date %></ns3:DueDate>
                    <ns3:Duration>1</ns3:Duration>
                    <ns3:VisitComplete>false</ns3:VisitComplete>
                    <ns3:Skills>
                        <ns3:Skill>Survey</ns3:Skill>
                    </ns3:Skills>
                    <ns3:Emergency>false</ns3:Emergency>
                    <ns3:WorkType><%= work_type %></ns3:WorkType>
                    <ns3:Dispatched>false</ns3:Dispatched>
                  <% if user_name %>
                    <ns3:AllocatedTo>
                        <ns3:Username><%=h user_name %></ns3:Username>
                    </ns3:AllocatedTo>
                  <% end %>
                    <ns3:AppointmentPending>false</ns3:AppointmentPending>
                    <ns3:World>
                        <ns3:Reference><%= world %></ns3:Reference>
                    </ns3:World>
                  <% if tla == 'GFF' || tla == 'LFS' %>
                    <ns3:AdditionalProperties>
                      <ns5:AdditionalProperty>
                        <ns5:Name>Serno</ns5:Name>
                        <ns5:Value>Serno</ns5:Value>
                      </ns5:AdditionalProperty>
                      <ns5:AdditionalProperty>
                        <ns5:Name>TLA</ns5:Name>
                        <ns5:Value>TLA</ns5:Value>
                      </ns5:AdditionalProperty>
                      <ns5:AdditionalProperty>
                        <ns5:Name>Week</ns5:Name>
                        <ns5:Value>Week</ns5:Value>
                      </ns5:AdditionalProperty>
                      <ns5:AdditionalProperty>
                        <ns5:Name>Wave</ns5:Name>
                        <ns5:Value>Wave</ns5:Value>
                      </ns5:AdditionalProperty>
                      <ns5:AdditionalProperty>
                        <ns5:Name>Prem1</ns5:Name>
                        <ns5:Value>Prem1</ns5:Value>
                      </ns5:AdditionalProperty>
                      <ns5:AdditionalProperty>
                        <ns5:Name>Prem2</ns5:Name>
                        <ns5:Value>Prem2</ns5:Value>
                      </ns5:AdditionalProperty>
                      <ns5:AdditionalProperty>
                        <ns5:Name>Prem3</ns5:Name>
                        <ns5:Value>Prem3</ns5:Value>
                      </ns5:AdditionalProperty>
                      <ns5:AdditionalProperty>
                        <ns5:Name>Prem4</ns5:Name>
                        <ns5:Value>Prem4</ns5:Value>
                      </ns5:AdditionalProperty>
                      <ns5:AdditionalProperty>
                        <ns5:Name>District</ns5:Name>
                        <ns5:Value>District</ns5:Value>
                      </ns5:AdditionalProperty>
                      <ns5:AdditionalProperty>
                        <ns5:Name>PostTown</ns5:Name>
                        <ns5:Value>PostTown</ns5:Value>
                      </ns5:AdditionalProperty>
                      <ns5:AdditionalProperty>
                        <ns5:Name>Postcode</ns5:Name>
                        <ns5:Value>Postcode</ns5:Value>
                      </ns5:AdditionalProperty>
                      <ns5:AdditionalProperty>
                        <ns5:Name>Quota</ns5:Name>
                        <ns5:Value>Quota</ns5:Value>
                      </ns5:AdditionalProperty>
                      <ns5:AdditionalProperty>
                        <ns5:Name>AddressNo</ns5:Name>
                        <ns5:Value>AddressNo</ns5:Value>
                      </ns5:AdditionalProperty>
                      <ns5:AdditionalProperty>
                        <ns5:Name>Year</ns5:Name>
                        <ns5:Value>Year</ns5:Value>
                      </ns5:AdditionalProperty>
                      <ns5:AdditionalProperty>
                        <ns5:Name>Month</ns5:Name>
                        <ns5:Value>Month</ns5:Value>
                      </ns5:AdditionalProperty>
                      <ns5:AdditionalProperty>
                        <ns5:Name>ContactNo</ns5:Name>
                        <ns5:Value>ContactNo</ns5:Value>
                      </ns5:AdditionalProperty>
                      <ns5:AdditionalProperty>
                        <ns5:Name>GeoX</ns5:Name>
                        <ns5:Value>GeoX</ns5:Value>
                      </ns5:AdditionalProperty>
                      <ns5:AdditionalProperty>
                        <ns5:Name>GeoY</ns5:Name>
                        <ns5:Value>GeoY</ns5:Value>
                      </ns5:AdditionalProperty>
                    </ns3:AdditionalProperties>
                  <% end %>
                </ns4:Job>
            </ns2:CreateJobRequest>
        </ns2:SendCreateJobRequestMessage>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
